app/controllers/patients_controller.rb

	def index
		@patients = Patient.all
---
SELECT "patients".* FROM "patients"

	def show
  		@patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 5]]

	def create
		#Instantiate a new object using form parameters
	    #@ward = Ward.new(params[:ward])
	    #@ward = Ward.new(params.require(:ward).permit(:name))
	    @patient = Patient.new(patient_params)
	    #save the object
	    if @patient.save
---
INSERT INTO "patients" ("address", "age", "created_at", "diagnosis", "name", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", "adeg"], ["age", 14], ["created_at", "2014-10-31 01:23:20.778264"], ["diagnosis", "malaria"], ["name", "abideen"], ["status", "okay"], ["updated_at", "2014-10-31 01:23:20.778264"]]

	def edit
		@patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]

	def update
  		#Find an existing object using form parameters
	    #@patient = Patient.new(params[:patient])
	    #@patient = Patient.new(params.require(:patient).permit(:name))
	    @patient = Patient.find(params[:id])
	    #update the object
	    if @patient.update_attributes(patient_params)
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "patients" SET "status" = ?, "updated_at" = ? WHERE "patients"."id" = 1  [["status", "discharged"], ["updated_at", "2014-11-02 12:27:50.073041"]]

	def delete
		@patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]

	def destroy
		@patient = Patient.find(params[:id]).destroy
---
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]
SELECT  "patients".* FROM "patients"  WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]