app/controllers/wards_controller.rb

SELECT "wards".* FROM "wards"   ORDER BY wards.position ASC
---
  def index
    @wards = Ward.all

SELECT  "wards".* FROM "wards"  WHERE "wards"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @ward = Ward.find(params[:id])

INSERT INTO "wards" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-02 01:31:36.420256"], ["name", "Surgery"], ["updated_at", "2014-11-02 01:31:36.420256"]]
---
  def create
    #Instantiate a new object using form parameters
    #@ward = Ward.new(params[:ward])
    #@ward = Ward.new(params.require(:ward).permit(:name))
    @ward = Ward.new(ward_params)
    #save the object
    if @ward.save

SELECT  "wards".* FROM "wards"  WHERE "wards"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @ward = Ward.find(params[:id])

SELECT  "wards".* FROM "wards"  WHERE "wards"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "wards" SET "name" = ?, "updated_at" = ? WHERE "wards"."id" = 3  [["name", "Surgerer"], ["updated_at", "2014-11-02 01:47:43.118555"]]
---
  def update
    #Find an existing object using form parameters
    #@ward = Ward.new(params[:ward])
    #@ward = Ward.new(params.require(:ward).permit(:name))
    @ward = Ward.find(params[:id])
    #update the object
    if @ward.update_attributes(ward_params)

SELECT  "wards".* FROM "wards"  WHERE "wards"."id" = ? LIMIT 1  [["id", 1]]
---
  def delete
    @ward = Ward.find(params[:id])

DELETE FROM "wards" WHERE "wards"."id" = ?  [["id", 1]]
SELECT  "wards".* FROM "wards"  WHERE "wards"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    ward = Ward.find(params[:id]).destroy