app/views/wards/index.html.erb


      <td class="center"><%= ward.patients.size %></td>
---
SELECT COUNT(*) FROM "patients"  WHERE "patients"."ward_id" = ?  [["ward_id", 1]]